In [2]:
#!wget --no-check-certificate https://drive.google.com/uc?id=1zBM3idCNWceBMLKMRBTN8aVFAg5U_YH7 -O Sachin_ODI.csv

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
df_sachin = pd.read_csv("Sachin_ODI.csv")
df_sachin

,runs,NotOut,mins,bf,fours,sixes,sr,Inns,Opp,Ground,Date,Winner,Won,century
0,13,0,30,15,3,0,86.66,1,New Zealand,Napier,1995-02-16,New Zealand,False,False
1,37,0,75,51,3,1,72.54,2,South Africa,Hamilton,1995-02-18,South Africa,False,False
2,47,0,65,40,7,0,117.50,2,Australia,Dunedin,1995-02-22,India,True,False
3,48,0,37,30,9,1,160.00,2,Bangladesh,Sharjah,1995-04-05,India,True,False
4,4,0,13,9,1,0,44.44,2,Pakistan,Sharjah,1995-04-07,Pakistan,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
355,14,0,34,15,2,0,93.33,2,Australia,Sydney,2012-02-26,Australia,False,False
356,39,0,45,30,5,0,130.00,2,Sri Lanka,Hobart,2012-02-28,India,True,False
357,6,0,25,19,1,0,31.57,1,Sri Lanka,Dhaka,2012-03-13,India,True,False
358,114,0,205,147,12,1,77.55,1,Bangladesh,Dhaka,2012-03-16,Bangladesh,False,True
359,52,0,93,48,5,1,108.33,2,Pakistan,Dhaka,2012-03-18,India,True,False

In [5]:
df_sachin.describe()

,runs,NotOut,bf,fours,sixes,sr,Inns
count,360.000000,360.000000,360.000000,360.000000,360.000000,360.000000,360.000000
mean,43.241667,0.083333,49.394444,4.858333,0.466667,75.295056,1.527778
std,42.182452,0.276770,41.348576,4.722900,1.057669,34.980677,0.499923
min,0.000000,0.000000,2.000000,0.000000,0.000000,0.000000,1.000000
25%,8.000000,0.000000,15.000000,1.000000,0.000000,57.030000,1.000000
50%,30.000000,0.000000,35.000000,3.000000,0.000000,76.330000,2.000000
75%,67.000000,0.000000,73.500000,8.000000,1.000000,97.822500,2.000000
max,200.000000,1.000000,153.000000,25.000000,7.000000,196.550000,2.000000